package cvs.dummy;

import java.io.BufferedWriter;
import java.io.FileWriter;
import java.util.Arrays;
import java.util.Calendar;
import java.util.Collections;
import java.util.List;
import java.util.Random;
import java.util.Scanner;

//import com.test.io.UI;

public class MemberDummy {
   // 모든 메소드에서 사용하는 공용 자원
   private static Scanner scan;
   private static final String DATA;
   private static Random rnd;
   static {
      scan = new Scanner(System.in);
      DATA = "dat\\member.dat";
      rnd = new Random();
   }

   public static String randomHangulName() {
      List<String> 성 = Arrays.asList("김", "이", "박", "최", "정", "강", "조", "윤", "장", "임", "한", "오", "서", "신", "권", "황",
            "안", "송", "류", "전", "홍", "고", "문", "양", "손", "배", "조", "백", "허", "유", "남", "심", "노", "정", "하", "곽", "성",
            "차", "주", "우", "구", "신", "임", "나", "전", "민", "유", "진", "지", "엄", "채", "원", "천", "방", "공", "강", "현", "함",
            "변", "염", "양", "변", "여", "추", "노", "도", "소", "신", "석", "선", "설", "마", "길", "주", "연", "방", "위", "표", "명",
            "기", "반", "왕", "금", "옥", "육", "인", "맹", "제", "모", "장", "남", "탁", "국", "여", "진", "어", "은", "편", "구",
            "용");
      List<String> 이름 = Arrays.asList(" ", "가", "강", "건", "경", "고", "관", "광", "구", "규", "근", "기", "길", "나", "남", "노",
            "누", "다", "단", "달", "담", "대", "덕", "도", "동", "두", "라", "래", "로", "루", "리", "마", "만", "명", "무", "문", "미",
            "민", "바", "박", "백", "범", "별", "병", "보", "빛", "사", "산", "상", "새", "서", "석", "선", "설", "섭", "성", "세", "소",
            "솔", "수", "숙", "순", "숭", "슬", "승", "시", "신", "아", "안", "애", "엄", "여", "연", "영", "예", "오", "옥", "완", "요",
            "용", "우", "원", "월", "위", "유", "윤", "율", "으", "은", "의", "이", "익", "인", "일", "잎", "자", "잔", "장", "재", "전",
            "정", "제", "조", "종", "주", "준", "중", "지", "진", "찬", "창", "채", "천", "철", "초", "춘", "충", "치", "탐", "태", "택",
            "판", "하", "한", "해", "혁", "현", "형", "혜", "호", "홍", "화", "환", "회", "효", "훈", "휘", "희", "운", "모", "배", "부",
            "림", "봉", "혼", "황", "량", "린", "을", "비", "솜", "공", "면", "탁", "온", "디", "항", "후", "려", "균", "묵", "송", "욱",
            "휴", "언", "령", "섬", "들", "견", "추", "걸", "삼", "열", "웅", "분", "변", "양", "출", "타", "흥", "겸", "곤", "번", "식",
            "란", "더", "손", "술", "훔", "반", "빈", "실", "직", "흠", "흔", "악", "람", "뜸", "권", "복", "심", "헌", "엽", "학", "개",
            "롱", "평", "늘", "늬", "랑", "얀", "향", "울", "련");
      Collections.shuffle(성);
      Collections.shuffle(이름);
      return 성.get(0) + 이름.get(0) + 이름.get(1);
   }

   public static void main(String[] args) {
      String passwd = "";
      String name = "";
      String sex = "";
      String cardNum = "";
      String total = "";
      
      String age = "";
      int month = 0;
      int day = 0;
      
      try {
        BufferedWriter writer = new BufferedWriter(new FileWriter("dat\\data.txt",true));
        for (int i = 31; i < 1000; i++) {
           passwd = rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10);
           name = randomHangulName();
           sex = rnd.nextInt(2) == 0 ? "남자" : "여자";
           //age = rnd.nextInt(70) + "";
           Calendar year = Calendar.getInstance();
           age = year.get(Calendar.YEAR) - (rnd.nextInt(56) + 15 ) + "";
           month = rnd.nextInt(12) + 1;
           if (month == 1 || month == 3 || month == 5 || month == 7 || month == 8 || month == 10 || month == 11 ) {
        	   day = rnd.nextInt(31) + 1;
           } else {
        	   day = rnd.nextInt(30) + 1;
           }
           
           cardNum = rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10)+"-"
                 + rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10)+"-"
                 + rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10)+"-"
                 + rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10)+""+rnd.nextInt(10)+"";
         
           writer.write(String.format("%04d■%s■%s■%s■%s%02d%02d■%s", i,passwd,name,sex,age.substring(2),month,day,cardNum));
           writer.newLine();
             }
        writer.flush();
        writer.close();
         }catch(Exception e) {
            System.out.println("RandomName.main() : " + e.toString());
         }
   }
}

/*
 * 회원정보
 * 
 * 
 * 
 * 회원번호 비밀번호 이름 성별 나이 카드번호 // 장바구니(구매내역)
 * 
 * 10대이하(5명)
 * 
 * 0001 264231 박한별 여자 19 4821-9898-1594-8495 0002 508312 임지혜 여자 16
 * 5569-7894-6565-6206 0003 156987 김지훈 남자 16 6619-6918-1191-6988 0004 654105 송민국
 * 남자 18 8191-1938-8861-6715 0005 123456 송만세 남자 17 9891-5336-5233-4988
 * 
 * 
 * 20대(6명)
 * 
 * 0006 016896 유훈규 남자 21 6191-8135-9818-6178 0007 984903 강재성 남자 26
 * 6317-1153-5181-1743 0008 489753 조완민 남자 28 0656-0609-0990-6461 0009 780632 김슬기
 * 여자 22 0480-4880-6868-3334 0010 648463 최별 여자 20 2918-6128-8161-0981 0011
 * 849963 남지석 남자 25 9086-5198-4690-1876
 * 
 * 30대(7명)
 * 
 * 0012 480356 강하늘 남자 34 1981-1686-9156-1919 0013 098933 양미래 여자 35
 * 9591-9828-1348-9849 0014 664898 윤지수 여자 30 8615-3214-8499-1519 0015 651122 손수민
 * 여자 31 4984-0498-1499-1984 0016 089835 남현규 남자 36 9891-2523-6865-2982 0017
 * 986867 장채연 여자 35 6524-8998-5179-9652 0018 198198 조병규 남자 34
 * 2429-2411-2324-9893
 * 
 * 40대(9명)
 * 
 * 0019 475602 송대한 남자 42 4495-1499-8994-2413 0020 651893 한명준 남자 43
 * 9849-4492-4612-2346 0021 654098 최예지 여자 44 2654-9812-4525-4785 0022 654353 나성민
 * 남자 45 2148-9494-2441-0205 0023 480835 전여환 남자 41 1595-4982-1981-8798 0024
 * 654103 송바다 여자 42 6459-6479-1984-4812 0025 653534 임주연 여자 49
 * 7742-7265-9985-3753 0026 846498 서영훈 남자 48 4989-1917-1084-5756 0027 119835 오충현
 * 남자 40 8912-4891-4984-7988
 * 
 * 
 * 50대이상(3명)
 * 
 * 
 * 0028 987683 김혜숙 여자 51 7982-9423-4991-9765 0029 457234 정종철 남자 65
 * 9980-8460-8618-0105 0030 016506 최진복 남자 58 9809-9809-8542-3098
 * 
 * 
 * 
 * 2340대 10대이하 50대이상 70% 30% 21명 9명
 * 
 * 10/20/30/40/50 5/ 6/ 7/ 9/ 3
 * 
 */